app/views/favorites/_favorite.html.erb

            submitted <%= time_ago_in_words(favorite.post.created_at) %> ago by <%= favorite.post.user.name %> |
            <%= pluralize(favorite.post.comments.count, "comment") %> |
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 17]]