app/views/users/show.html.erb

SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]
---
                <small>
                    <%= pluralize(@user.posts.count, 'post') %>
                    <br>
                    <%= pluralize(@user.comments.count, 'comment') %>