app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 39]]
INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "jjjjjjja sfajslfj"], ["post_id", 39], ["user_id", 1], ["created_at", "2017-06-01 07:34:31.048492"], ["updated_at", "2017-06-01 07:34:31.048492"]]
---
    def create
        @post = Post.find(params[:post_id])
        comment = @post.comments.create(comment_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 29]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 29], ["id", 52]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 52]]
---
    def destroy
        @post = Post.find(params[:post_id])
        comment = @post.comments.find(params[:id])

        if comment.destroy