app/controllers/favorites_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY rank DESC LIMIT 1  [["id", 17]]
INSERT INTO "favorites" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 17], ["user_id", 10], ["created_at", "2017-06-07 01:03:59.487194"], ["updated_at", "2017-06-07 01:03:59.487194"]]
---
    def create
        post = Post.find(params[:post_id])
        favorite = current_user.favorites.build(post: post)
        # why build and not create?

        if favorite.save