app/controllers/posts_controller.rb

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 12]]
INSERT INTO "posts" ("title", "body", "topic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aaaaaaaaa"], ["body", "asfasjf"], ["topic_id", 12], ["created_at", "2017-05-15 19:35:52.081527"], ["updated_at", "2017-05-15 19:35:52.081527"]]
---
  def create
    @post = Post.new
    @post.title = params[:post][:title]
    @post.body = params[:post][:body]
    # added below, topic_id is the params name, not id
    @topic = Topic.find(params[:topic_id])
    @post.topic = @topic
    # curious about the above syntax?
    # why not @post.topic_id = @topic.id?

    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY rank DESC LIMIT 1  [["id", 51]]
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?
---
  def update
    @post = Post.find(params[:id])
    @post.title = params[:post][:title]
    @post.body = params[:post][:body]
    # does @post.topic or @topic need defined here? Yes. Missing in curriculum.
    @topic = Topic.find(params[:topic_id])
    @post.topic = @topic

    if @post.save