app/controllers/topics_controller.rb

INSERT INTO "topics" ("name", "description", "public", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "asfjasfjaklsjklfj"], ["description", "asfjklsafjdklsfjksdl"], ["public", "f"], ["created_at", "2017-05-18 15:21:23.537704"], ["updated_at", "2017-05-18 15:21:23.537704"]]
---
    def create
        @topic = Topic.new(topic_params)

        # OLD WAY
        # @topic = Topic.new
        # @topic.name = params[:topic][:name]
        # @topic.description = params[:topic][:description]
        # @topic.public = params[:topic][:public]

        if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "topics" SET "name" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["name", "Yovhzdb ukoinzt adtf znci atvqzg xjpsq sjkl jkl jkl j"], ["updated_at", "2017-05-15 19:09:21.260204"], ["id", 4]]
---
    def update
        @topic = Topic.find(params[:id])
        @topic.assign_attributes(topic_params)

        # OLD WAY
        # @topic.name = params[:topic][:name]
        # @topic.description = params[:topic][:description]
        # @topic.public = params[:topic][:public]

        if @topic.save